# <img style="float: left; padding-right: 20px; width: 200px" src="https://raw.githubusercontent.com/raxlab/imt2200-data/main/media/logo.jpg">



# IMT 2200 - Introducción a Ciencia de Datos
**Pontificia Universidad Católica de Chile**<br>
**Instituto de Ingeniería Matemática y Computacional**<br>
**Profesor:** Rodrigo A. Carrasco <br>
**Alumno:** Israel Pino Saavedra <br>
---

Esta tarea tendrá como objetivo crear un predictor que determine el éxito o fracaso de una expedición a distintas montañas del Himalayas según datos del montañista y de la expedición. Vamos a responder a la pregunta de qué tan bien pueden atributos como año, estación, montaña, edad del montañista, entre otros, predecir el éxito o fracaso de una expedición.

# <h1><center> 3.1 DataFrame unificado (0.2 pts)
 </center></h1>

Sheets : https://docs.google.com/spreadsheets/d/11-fVTpCaHDj658sHjvNLFDWc1-Nyrv5u_Se79xvUAuI/edit?gid=0#gid=0

Conversa https://gemini.google.com/app/1a29c9a976bdb571

In [1]:
pip install plotly

Requirement already satisfied: plotly in /opt/miniconda3/lib/python3.13/site-packages (6.4.0)
Requirement already satisfied: narwhals>=1.15.1 in /opt/miniconda3/lib/python3.13/site-packages (from plotly) (2.10.2)
Requirement already satisfied: packaging in /opt/miniconda3/lib/python3.13/site-packages (from plotly) (25.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [3]:
df_peaks=pd.read_csv('Himalayan+Expeditions/peaks.csv')
df_peaks_exp=pd.read_csv('Himalayan+Expeditions/peaks_with_exp.csv')
df_exped=pd.read_csv('Himalayan+Expeditions/exped.csv')
df_members=pd.read_csv('Himalayan+Expeditions/members.csv')

/var/folders/2m/78v6gw9x19x1vhlbn1gn2pp40000gn/T/ipykernel_4578/876091035.py:3: DtypeWarning: Columns (8,18,19) have mixed types. Specify dtype option on import or set low_memory=False.
  df_exped=pd.read_csv('Himalayan+Expeditions/exped.csv')
/var/folders/2m/78v6gw9x19x1vhlbn1gn2pp40000gn/T/ipykernel_4578/876091035.py:4: DtypeWarning: Columns (34) have mixed types. Specify dtype option on import or set low_memory=False.
  df_members=pd.read_csv('Himalayan+Expeditions/members.csv')

In [4]:
picos="df_peaks"
expediciones="df_exped"
miembros="df_members"
picosyexpediciones="df_peaks_exp"

In [5]:
print(f"Columnas de {picos}: es {df_peaks.columns.tolist()}")
print(f"Columnas de {expediciones}: es {df_exped.columns.tolist()}")
print(f"Columnas de {miembros}: es {df_members.columns.tolist()}")
print(f"Columnas de {picosyexpediciones}: es {df_peaks_exp.columns.tolist()}")

Columnas de df_peaks: es ['peakid', 'pkname', 'pkname2', 'location', 'heightm', 'heightf', 'himal', 'region', 'open', 'unlisted', 'trekking', 'trekyear', 'restrict', 'phost', 'pstatus', 'pyear', 'pseason', 'pmonth', 'pday', 'pexpid', 'pcountry', 'psummiters', 'psmtnote']
Columnas de df_exped: es ['expid', 'peakid', 'year', 'season', 'host', 'route1', 'route2', 'route3', 'route4', 'nation', 'leaders', 'sponsor', 'success1', 'success2', 'success3', 'success4', 'ascent1', 'ascent2', 'ascent3', 'ascent4', 'claimed', 'disputed', 'countries', 'approach', 'bcdate', 'smtdate', 'smttime', 'smtdays', 'totdays', 'termdate', 'termreason', 'termnote', 'highpoint', 'traverse', 'ski', 'parapente', 'camps', 'rope', 'totmembers', 'smtmembers', 'mdeaths', 'tothired', 'smthired', 'hdeaths', 'nohired', 'o2used', 'o2none', 'o2climb', 'o2descent', 'o2sleep', 'o2medical', 'o2taken', 'o2unkwn', 'othersmts', 'campsites', 'accidents', 'achievment', 'agency', 'comrte', 'stdrte', 'primrte', 'primmem', 'primref', 'primid', 'chksum']
Columnas de df_members: es ['expid', 'membid', 'peakid', 'myear', 'mseason', 'fname', 'lname', 'sex', 'yob', 'citizen', 'status', 'residence', 'occupation', 'leader', 'deputy', 'bconly', 'nottobc', 'support', 'disabled', 'hired', 'sherpa', 'tibetan', 'msuccess', 'mclaimed', 'mdisputed', 'msolo', 'mtraverse', 'mski', 'mparapente', 'mspeed', 'mhighpt', 'mperhighpt', 'msmtdate1', 'msmtdate2', 'msmtdate3', 'msmttime1', 'msmttime2', 'msmttime3', 'mroute1', 'mroute2', 'mroute3', 'mascent1', 'mascent2', 'mascent3', 'mo2used', 'mo2none', 'mo2climb', 'mo2descent', 'mo2sleep', 'mo2medical', 'mo2note', 'death', 'deathdate', 'deathtime', 'deathtype', 'deathhgtm', 'deathclass', 'msmtbid', 'msmtterm', 'hcn', 'mchksum']
Columnas de df_peaks_exp: es ['peakid', 'pkname', 'pkname2', 'location', 'heightm', 'heightf', 'himal', 'region', 'open', 'unlisted', 'trekking', 'trekyear', 'restrict', 'phost', 'pstatus', 'pyear', 'pseason', 'pmonth', 'pday', 'pexpid', 'pcountry', 'psummiters', 'psmtnote', 'failed_exp', 'success_exp']

Eliminamos las columnas que no usaremos

In [6]:
df_peaks= df_peaks[["peakid","pkname","heightm"]]
df_exped= df_exped[["expid","peakid","year","season"]]
df_members=df_members[["expid","membid","peakid","sex","myear","yob","citizen","msuccess"]]
df_peaks_exp=df_peaks_exp[["peakid","success_exp","failed_exp"]]

In [7]:
print (f"El total de filas de {picos} es {len(df_peaks)}")
print (f"El total de filas de {expediciones} es {len(df_exped)}")
print (f"El total de filas de {miembros} es {len(df_members)}")
print (f"El total de filas de {picosyexpediciones} es {len(df_peaks_exp)}")

El total de filas de df_peaks es 480
El total de filas de df_exped es 11425
El total de filas de df_members es 89000
El total de filas de df_peaks_exp es 480

In [8]:
print(f"Se repiten {df_peaks["peakid"].duplicated().sum()} peakid de {picos}")
print(f"Se repiten {df_exped["expid"].duplicated().sum()} expid de {expediciones}")
print(f"Se repiten {df_members["expid"].duplicated().sum()} expid de {miembros}")
print(f"Se repiten {df_peaks_exp["peakid"].duplicated().sum()} peakid de {picosyexpediciones}")

Se repiten 0 peakid de df_peaks
Se repiten 4 expid de df_exped
Se repiten 77594 expid de df_members
Se repiten 0 peakid de df_peaks_exp

In [9]:
df_peaks.head()

  peakid         pkname  heightm
0   ACHN         Aichyn     6055
1   AMAD     Ama Dablam     6814
2   AMOT       Amotsang     6393
3   AMPG  Amphu Gyabjen     5630
4   AMPH        Amphu I     6740

In [10]:
df_peaks_exp.head()

  peakid  success_exp  failed_exp
0   ACHN            2           1
1   AMAD         1123         453
2   AMOT            1           2
3   AMPG            3           1
4   AMPH            1           1

In [11]:
df1= pd.merge(
    df_peaks,
    df_peaks_exp,
    on="peakid",
    how="outer"
)
df1.head()
print(f"filas primer merge {len(df1)}")

filas primer merge 480

Aqui nos dimos cuenta que teniamos valores duplicados porque al hacer merge entre df_2 y members, no nos daban las 89000 filas del dataframe de members sino que nos daban 89089 .
Ahora la demostración

In [12]:
#filas de df_members
len(df_members)

89000

In [13]:
df_final = pd.merge(
    df_members,                  # Izquierda: Queremos 89000 filas
    df_exped,                    # Derecha: Expediciones (con clave única)
    on='expid',            
    how='left'
)
print(f"El total de filas de df_final es {len(df_final)}")

El total de filas de df_final es 89089

Entonces decidimos hacer una pequeña modificacion a las columnas

In [14]:
print(f"Se repiten {df_peaks["peakid"].duplicated().sum()} peakid de {picos}")
print(f"Se repiten {df_exped["expid"].duplicated().sum()} expid de {expediciones}")
print(f"Se repiten {df_members["expid"].duplicated().sum()} expid de {miembros}")
print(f"Se repiten {df_peaks_exp["peakid"].duplicated().sum()} peakid de {picosyexpediciones}")

Se repiten 0 peakid de df_peaks
Se repiten 4 expid de df_exped
Se repiten 77594 expid de df_members
Se repiten 0 peakid de df_peaks_exp

In [15]:
"""BUSCAMOS LAS FILAS DUPLICADAS EN EXPEDICIONES"""

#   creamos una columna con el tag true o false, siendo true si la fila expid está duplicado
df_exped['Column_duplicada'] = df_exped.duplicated(subset=['expid'], keep=False)

#  filtramos  la columna unicamente por los valores q son verdaderos
df_duplicados = df_exped[df_exped['Column_duplicada'] == True]

#buscamos en la columna expid cuales son los valores duplicados (nos ayudamos del true)
columna_expid_duplicados = df_duplicados['expid']

#obtenemos la lista de valores únicos de esos 'expid' repetidos
expid_duplicadas = columna_expid_duplicados.unique()

# Opcional: Eliminar la columna auxiliar
df_exped = df_exped.drop(columns=['Column_duplicada'])
print(f"\n Resumen de las filas expid repetidas \n  \
      {expid_duplicadas}")
print("Estas celdas que eran parte del dataframe de expedicion se \n" 
"repiten porque hay un error en el dataset original, y por tal motivo \n" \
"los identifico")

 Resumen de las filas expid repetidas
        ['EVER21101' 'EVER22101' 'EVER24101' 'KANG10101']
Estas celdas que eran parte del dataframe de expedicion se
repiten porque hay un error en el dataset original, y por tal motivo
los identifico

In [16]:
# Creamos claves compuestas para asegurar unicidad

#  1. Crear la clave compuesta en df_exped
df_exped['expid_nueva'] = df_exped['expid'] + '_' + df_exped['year'].astype(str)

# 2. Crear la clave compuesta en df_members
df_members['expid_nueva'] = df_members['expid'] + '_' + df_members['myear'].astype(str)

In [17]:
df_exped.head()

       expid peakid  year  season     expid_nueva
0  ANN260101   ANN2  1960  Spring  ANN260101_1960
1  ANN269301   ANN2  1969  Autumn  ANN269301_1969
2  ANN273101   ANN2  1973  Spring  ANN273101_1973
3  ANN278301   ANN2  1978  Autumn  ANN278301_1978
4  ANN279301   ANN2  1979  Autumn  ANN279301_1979

In [18]:
df_members.head()

,expid,membid,peakid,sex,myear,yob,citizen,msuccess,expid_nueva
0,AMAD01101,2,AMAD,M,2001,1972.0,Australia,False,AMAD01101_2001
1,AMAD01101,1,AMAD,M,2001,1968.0,Australia,False,AMAD01101_2001
2,AMAD01101,3,AMAD,M,2001,1960.0,Australia,False,AMAD01101_2001
3,AMAD01101,4,AMAD,M,2001,1966.0,Australia,False,AMAD01101_2001
4,AMAD01101,5,AMAD,F,2001,1970.0,Australia,False,AMAD01101_2001

In [19]:
df_2= pd.merge(
    df_exped,
    df1,
    on=['peakid'], 
    how='left'               
)               
print (f"El total de filas de df_2 es {len(df_2)}")

El total de filas de df_2 es 11425

In [20]:
# Unir df_members y df_exped usando la nueva clave única
df_final = pd.merge(
    df_members,                  # Izquierda: Queremos 89000 filas
    df_2,                    # Derecha: Expediciones (con clave única)
    on='expid_nueva',            # Clave de unión: 'expid_año'
    how='left'
)

print(f"El total de filas de df_final es {len(df_final)}")
# El total de filas debe ser 89000.

El total de filas de df_final es 89000

In [21]:
df_final.head()

,expid_x,membid,peakid_x,sex,myear,yob,citizen,msuccess,expid_nueva,expid_y,peakid_y,year,season,pkname,heightm,success_exp,failed_exp
0,AMAD01101,2,AMAD,M,2001,1972.0,Australia,False,AMAD01101_2001,AMAD01101,AMAD,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
1,AMAD01101,1,AMAD,M,2001,1968.0,Australia,False,AMAD01101_2001,AMAD01101,AMAD,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
2,AMAD01101,3,AMAD,M,2001,1960.0,Australia,False,AMAD01101_2001,AMAD01101,AMAD,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
3,AMAD01101,4,AMAD,M,2001,1966.0,Australia,False,AMAD01101_2001,AMAD01101,AMAD,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
4,AMAD01101,5,AMAD,F,2001,1970.0,Australia,False,AMAD01101_2001,AMAD01101,AMAD,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0

In [22]:
df_final.columns

Index(['expid_x', 'membid', 'peakid_x', 'sex', 'myear', 'yob', 'citizen',
       'msuccess', 'expid_nueva', 'expid_y', 'peakid_y', 'year', 'season',
       'pkname', 'heightm', 'success_exp', 'failed_exp'],
      dtype='object')

In [23]:
df_final=df_final.drop(columns=['expid_y','peakid_y'])

In [24]:

df_final = df_final.rename(columns={'expid_x': 'expid','peakid_x': 'peakid'})

In [25]:
"""cambio el orden de las columnas
df_final= df_final["expid_nueva","expid","membid","peakid",	"sex",	"myear","yob","citizen","msuccess",	"year",	"season","pkname",	"heightm",	"success_exp","failed_exp"]"""

'cambio el orden de las columnas\ndf_final= df_final["expid_nueva","expid","membid","peakid",\t"sex",\t"myear","yob","citizen","msuccess",\t"year",\t"season","pkname",\t"heightm",\t"success_exp","failed_exp"]'

In [26]:
df_final.head()

,expid,membid,peakid,sex,myear,yob,citizen,msuccess,expid_nueva,year,season,pkname,heightm,success_exp,failed_exp
0,AMAD01101,2,AMAD,M,2001,1972.0,Australia,False,AMAD01101_2001,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
1,AMAD01101,1,AMAD,M,2001,1968.0,Australia,False,AMAD01101_2001,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
2,AMAD01101,3,AMAD,M,2001,1960.0,Australia,False,AMAD01101_2001,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
3,AMAD01101,4,AMAD,M,2001,1966.0,Australia,False,AMAD01101_2001,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0
4,AMAD01101,5,AMAD,F,2001,1970.0,Australia,False,AMAD01101_2001,2001.0,Spring,Ama Dablam,6814.0,1123.0,453.0

Ahora si tenemos un dataframe correctamente creado

---

# <h1><center>Limpieza y Transformación </center></h1>